#  <span style='color:Red'>Activity 7 (Practice)
## <span style='color:Yellow'> Name : </span> `Amartyaraj Kumar`
###  <span style='color:Yellow'> Roll : </span>  `19029` 
#### <span style='color:Yellow'> Date : </span>  `02/10/22`

# Part 1

#####  <span style='color:Green'>Activity 1: </span> `Creating a Pandas Series`

In [1]:
import numpy as np 
labels = ['a','b','c'] 
my_data = [10,20,30] 
array_1 = np.array(my_data) 
d = {'a':10,'b':20,'c':30}

In [2]:
import pandas as pd

In [3]:
print("\nHolding numerical data\n",'-'*25, sep='') 
print(pd.Series(array_1))

Holding numerical data
-------------------------
0    10
1    20
2    30
dtype: int32

In [4]:
print("\nHolding text labels\n",'-'*20, sep='') 
print(pd.Series(labels))

Holding text labels
--------------------
0    a
1    b
2    c
dtype: object

In [6]:
print("\nHolding functions\n",'-'*20, sep='') 
print(pd.Series(data=[sum,print,len]))

Holding functions
--------------------
0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [12]:
print("\nHolding objects from a dictionary\n",'-'*40, sep='') 
print(pd.Series(data=[d.keys, d.items, d.values]))

Holding objects from a dictionary
----------------------------------------
0    <built-in method keys of dict object at 0x0000...
1    <built-in method items of dict object at 0x000...
2    <built-in method values of dict object at 0x00...
dtype: object

#####  <span style='color:Green'>Activity 2: </span> `Pandas Series and Data Handling`

In [13]:
import numpy as np 
import pandas as pd 
labels = ['a','b','c'] 
my_data = [10,20,30] 
array_1 = np.array(my_data) 
d = {'a':10,'b':20,'c':30} 
print("\nHolding numerical data\n",'-'*25, sep='') 
print(pd.Series(array_1))

Holding numerical data
-------------------------
0    10
1    20
2    30
dtype: int32

In [14]:
print("\nHolding text labels\n",'-'*20, sep='') 
print(pd.Series(labels))

Holding text labels
--------------------
0    a
1    b
2    c
dtype: object

In [15]:
print("\nHolding functions\n",'-'*20, sep='') 
print(pd.Series(data=[sum,print,len]))

Holding functions
--------------------
0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [16]:
print("\nHolding objects from a dictionary\n",'-'*40, sep='') 
print(pd.Series(data=[d.keys, d.items, d.values]))

Holding objects from a dictionary
----------------------------------------
0    <built-in method keys of dict object at 0x0000...
1    <built-in method items of dict object at 0x000...
2    <built-in method values of dict object at 0x00...
dtype: object

#####  <span style='color:Green'>Activity 3: </span> `Creating Pandas DataFrames`

In [21]:
import numpy as np 
import pandas as pd 
matrix_data = np.random.randint(1,10,size=20).reshape(5,4)

In [23]:
row_labels = ['A','B','C','D','E'] 
column_headings = ['W','X','Y','Z']

In [27]:
df = pd.DataFrame(data=matrix_data, index=row_labels, columns=column_headings)

In [26]:
print("\nThe data frame looks like\n",'-'*45, sep='') 
print(df)

The data frame looks like
---------------------------------------------
   W  X  Y  Z
A  5  5  5  3
B  7  2  2  5
C  9  6  5  4
D  4  9  1  6
E  4  1  3  3

In [28]:
d={'a':[10,20],'b':[30,40],'c':[50,60]}

In [29]:
df2=pd.DataFrame(data=d,index=['X','Y']) 
print(df2)

    a   b   c
X  10  30  50
Y  20  40  60

#####  <span style='color:Green'>Activity 4: </span> `Viewing a DataFrame Partially`

In [30]:
import numpy as np 
import pandas as pd 
matrix_data = np.random.randint(1,100,100).reshape(25,4)
column_headings = ['W','X','Y','Z'] 
df = pd.DataFrame(data=matrix_data,columns=column_headings)

In [35]:
df.head()

    W   X   Y   Z
0  19  66  26  66
1  56  52  35  83
2  18  92  13   9
3  76   8  98  87
4  62  29  32  99

In [36]:
df.head(8)

    W   X   Y   Z
0  19  66  26  66
1  56  52  35  83
2  18  92  13   9
3  76   8  98  87
4  62  29  32  99
5  25  70  13  21
6  38  78  24  39
7  57  50  92  40

In [37]:
df.tail(10)

     W   X   Y   Z
15  46  49  83   3
16  71  92  45  99
17  35  31  29  87
18  36  56  10  90
19  73  48  70  78
20  65  65  77  60
21  45   8  13   4
22  39  81  52  76
23  37  41  89  21
24  26  72   4  29

#####  <span style='color:Green'>Activity 5: </span> `Creating and Deleting a New Column or Row`

In [42]:
import pandas as pd 
df = pd.read_csv("stock.csv") 
df.head() 
print("\nA column is created by assigning it in relation\n",'-'*75, sep='') 
df['New'] = df['Price']+df['Price'] 
df['New (Sum of X and Z)'] = df['New']+df['Price'] 
print(df)

A column is created by assigning it in relation
---------------------------------------------------------------------------
   Symbol  Price  New  New (Sum of X and Z)
0     MMM    100  200                   300
1     AOS    101  202                   303
2     ABT    102  204                   306
3    ABBV    103  206                   309
4     ACN    104  208                   312
5    ATVI    105  210                   315
6     AYI    106  212                   318
7    ADBE    107  214                   321
8     AAP    108  216                   324
9     AMD    109  218                   327
10    AES    110  220                   330
11    AET    111  222                   333
12    AMG    112  224                   336
13    AFL    113  226                   339
14      A    114  228                   342
15    APD    115  230                   345
16   AKAM    116  232                   348
17    ALK    117  234                   351
18    ALB    118  236                   354
19    ARE    119  238                   357
20   ALXN    120  240                   360
21   ALGN    121  242                   363
22   ALLE    122  244                   366
23    AGN    123  246                   369
24    ADS    124  248                   372
25    LNT    125  250                   375
26    ALL    126  252                   378
27  GOOGL    127  254                   381
28   GOOG    128  256                   384
29     MO    129  258                   387
30   AMZN    130  260                   390
31    AEE    131  262                   393
32    AAL    132  264                   396
33    AEP    133  266                   399
34    AXP    134  268                   402
35    AIG    135  270                   405
36    AMT    136  272                   408
37    AWK    137  274                   411
38    AMP    138  276                   414
39    ABC    139  278                   417
40    AME    140  280                   420
41   AMGN    141  282                   423
42    APH    142  284                   426
43    APC    143  286                   429
44    ADI    144  288                   432
45   ANDV    145  290                   435
46   ANSS    146  292                   438
47   ANTM    147  294                   441
48    AON    148  296                   444

In [43]:
print("\nA column is dropped by using df.drop() method\n",'-'*55, sep='')
df = df.drop('New', axis=1) # Notice the axis=1 option 
# axis = 0 is default, so one has to change it to 1 
print(df)

A column is dropped by using df.drop() method
-------------------------------------------------------
   Symbol  Price  New (Sum of X and Z)
0     MMM    100                   300
1     AOS    101                   303
2     ABT    102                   306
3    ABBV    103                   309
4     ACN    104                   312
5    ATVI    105                   315
6     AYI    106                   318
7    ADBE    107                   321
8     AAP    108                   324
9     AMD    109                   327
10    AES    110                   330
11    AET    111                   333
12    AMG    112                   336
13    AFL    113                   339
14      A    114                   342
15    APD    115                   345
16   AKAM    116                   348
17    ALK    117                   351
18    ALB    118                   354
19    ARE    119                   357
20   ALXN    120                   360
21   ALGN    121                   363
22   ALLE    122                   366
23    AGN    123                   369
24    ADS    124                   372
25    LNT    125                   375
26    ALL    126                   378
27  GOOGL    127                   381
28   GOOG    128                   384
29     MO    129                   387
30   AMZN    130                   390
31    AEE    131                   393
32    AAL    132                   396
33    AEP    133                   399
34    AXP    134                   402
35    AIG    135                   405
36    AMT    136                   408
37    AWK    137                   411
38    AMP    138                   414
39    ABC    139                   417
40    AME    140                   420
41   AMGN    141                   423
42    APH    142                   426
43    APC    143                   429
44    ADI    144                   432
45   ANDV    145                   435
46   ANSS    146                   438
47   ANTM    147                   441
48    AON    148                   444

In [44]:
df1=df.drop(1) 
print("\nA row is dropped by using df.drop method and axis=0\n", '-'*65, sep='') 
print(df1)

A row is dropped by using df.drop method and axis=0
-----------------------------------------------------------------
   Symbol  Price  New (Sum of X and Z)
0     MMM    100                   300
2     ABT    102                   306
3    ABBV    103                   309
4     ACN    104                   312
5    ATVI    105                   315
6     AYI    106                   318
7    ADBE    107                   321
8     AAP    108                   324
9     AMD    109                   327
10    AES    110                   330
11    AET    111                   333
12    AMG    112                   336
13    AFL    113                   339
14      A    114                   342
15    APD    115                   345
16   AKAM    116                   348
17    ALK    117                   351
18    ALB    118                   354
19    ARE    119                   357
20   ALXN    120                   360
21   ALGN    121                   363
22   ALLE    122                   366
23    AGN    123                   369
24    ADS    124                   372
25    LNT    125                   375
26    ALL    126                   378
27  GOOGL    127                   381
28   GOOG    128                   384
29     MO    129                   387
30   AMZN    130                   390
31    AEE    131                   393
32    AAL    132                   396
33    AEP    133                   399
34    AXP    134                   402
35    AIG    135                   405
36    AMT    136                   408
37    AWK    137                   411
38    AMP    138                   414
39    ABC    139                   417
40    AME    140                   420
41   AMGN    141                   423
42    APH    142                   426
43    APC    143                   429
44    ADI    144                   432
45   ANDV    145                   435
46   ANSS    146                   438
47   ANTM    147                   441
48    AON    148                   444

In [45]:
print("\nAn in-place change can be done by making ", "inplace=True in the drop method\n",'-'*75, sep='') 
df.drop('New (Sum of X and Z)', axis=1, inplace=True) 
print(df)

An in-place change can be done by making inplace=True in the drop method
---------------------------------------------------------------------------
   Symbol  Price
0     MMM    100
1     AOS    101
2     ABT    102
3    ABBV    103
4     ACN    104
5    ATVI    105
6     AYI    106
7    ADBE    107
8     AAP    108
9     AMD    109
10    AES    110
11    AET    111
12    AMG    112
13    AFL    113
14      A    114
15    APD    115
16   AKAM    116
17    ALK    117
18    ALB    118
19    ARE    119
20   ALXN    120
21   ALGN    121
22   ALLE    122
23    AGN    123
24    ADS    124
25    LNT    125
26    ALL    126
27  GOOGL    127
28   GOOG    128
29     MO    129
30   AMZN    130
31    AEE    131
32    AAL    132
33    AEP    133
34    AXP    134
35    AIG    135
36    AMT    136
37    AWK    137
38    AMP    138
39    ABC    139
40    AME    140
41   AMGN    141
42    APH    142
43    APC    143
44    ADI    144
45   ANDV    145
46   ANSS    146
47   ANTM    147
48    AON    148

# Part 2

#####  <span style='color:Violet'>Excercise 1: </span> `Using DataFrames to Manipulate Stored Student test score Data`

In [46]:
import pandas as pd
test_dict = {'Corey':[63,75,88], 'Kevin':[48,98,92], 'Akshay': [87, 86, 85]}
df = pd.DataFrame(test_dict)
df

   Corey  Kevin  Akshay
0     63     48      87
1     75     98      86
2     88     92      85

In [47]:
df = df.T 
df

         0   1   2
Corey   63  75  88
Kevin   48  98  92
Akshay  87  86  85

#####  <span style='color:Violet'>Excercise 2: </span> `DataFrame Computations with the Student testscore Data`

In [48]:
df.columns = ['Quiz_1', 'Quiz_2', 'Quiz_3'] 
df

        Quiz_1  Quiz_2  Quiz_3
Corey       63      75      88
Kevin       48      98      92
Akshay      87      86      85

In [49]:
df.iloc[0]

Quiz_1    63
Quiz_2    75
Quiz_3    88
Name: Corey, dtype: int64

In [50]:
df['Quiz_1']

Corey     63
Kevin     48
Akshay    87
Name: Quiz_1, dtype: int64

In [51]:
df.Quiz_1

Corey     63
Kevin     48
Akshay    87
Name: Quiz_1, dtype: int64

#####  <span style='color:Violet'>Excercise 3: </span> `Computing DataFrames within DataFrames`

In [52]:
test_dict = {'Corey':[63,75,88], 'Kevin':[48,98,92], 'Akshay': [87, 86, 85]} 
df = pd.DataFrame(test_dict)

In [53]:
df[0:2]

   Corey  Kevin  Akshay
0     63     48      87
1     75     98      86

In [55]:
df = df.T 
df

         0   1   2
Corey   63  75  88
Kevin   48  98  92
Akshay  87  86  85

In [56]:
df.columns = ['Quiz_1', 'Quiz_2', 'Quiz_3'] 
df

        Quiz_1  Quiz_2  Quiz_3
Corey       63      75      88
Kevin       48      98      92
Akshay      87      86      85

In [57]:
rows = ['Corey', 'Kevin'] 
cols = ['Quiz_2', 'Quiz_3'] 
df_spring = df.loc[rows, cols] 
df_spring

       Quiz_2  Quiz_3
Corey      75      88
Kevin      98      92

In [58]:
df.iloc[[0,1], [1,2]]

       Quiz_2  Quiz_3
Corey      75      88
Kevin      98      92

In [59]:
df['Quiz_Avg'] = df.mean(axis=1) 
df

        Quiz_1  Quiz_2  Quiz_3   Quiz_Avg
Corey       63      75      88  75.333333
Kevin       48      98      92  79.333333
Akshay      87      86      85  86.000000

In [60]:
df['Quiz_4'] = [92, 95, 88] 
df

        Quiz_1  Quiz_2  Quiz_3   Quiz_Avg  Quiz_4
Corey       63      75      88  75.333333      92
Kevin       48      98      92  79.333333      95
Akshay      87      86      85  86.000000      88

In [61]:
del df['Quiz_Avg'] 
df

        Quiz_1  Quiz_2  Quiz_3  Quiz_4
Corey       63      75      88      92
Kevin       48      98      92      95
Akshay      87      86      85      88

#####  <span style='color:Violet'>Excercise 4: </span> `Concatenating and Finding the Mean with Null Values for Our testscore Data`

In [70]:
import pandas as pd 
import numpy as np
test_dict = {'Corey':[63,75,88], 'Kevin':[48,98,92], 'Akshay': [87, 86, 85]} 
df = pd.DataFrame(test_dict)

In [71]:
df = df.T 
df.columns = ['Quiz_1', 'Quiz_2', 'Quiz_3'] 
df

        Quiz_1  Quiz_2  Quiz_3
Corey       63      75      88
Kevin       48      98      92
Akshay      87      86      85

In [72]:
df['Quiz_4'] = [92, 95, 88] 
df

        Quiz_1  Quiz_2  Quiz_3  Quiz_4
Corey       63      75      88      92
Kevin       48      98      92      95
Akshay      87      86      85      88

In [73]:
df_new = pd.DataFrame({'Quiz_1':[np.NaN], 'Quiz_2':[np.NaN], 'Quiz_3': [np.NaN], 'Quiz_4':[71]}, index=['Adrian'])

df = pd.concat([df, df_new])
df

        Quiz_1  Quiz_2  Quiz_3  Quiz_4
Corey     63.0    75.0    88.0      92
Kevin     48.0    98.0    92.0      95
Akshay    87.0    86.0    85.0      88
Adrian     NaN     NaN     NaN      71

In [74]:
df['Quiz_Avg'] = df.mean(axis=1, skipna=True) 
df

        Quiz_1  Quiz_2  Quiz_3  Quiz_4  Quiz_Avg
Corey     63.0    75.0    88.0      92     79.50
Kevin     48.0    98.0    92.0      95     83.25
Akshay    87.0    86.0    85.0      88     86.50
Adrian     NaN     NaN     NaN      71     71.00

In [75]:
df.Quiz_4.astype(float)

Corey     92.0
Kevin     95.0
Akshay    88.0
Adrian    71.0
Name: Quiz_4, dtype: float64

#####  <span style='color:Violet'>Excercise 5: </span> `Reading and Viewing the Boston Housing Dataset`

In [76]:
import pandas as pd

In [78]:
housing_df = pd.read_csv('Boston_housing.csv')

In [79]:
housing_df.head()

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,PRICE
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222,18.7,396.90,5.33,36.2

#####  <span style='color:Violet'>Excercise 6: </span> `Gaining Data Insights on the Boston Housing Dataset`

In [80]:
housing_df.describe()

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,PRICE
count,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000
mean,3.593761,11.363636,11.136779,0.069170,0.554695,6.284634,68.574901,3.795043,9.549407,408.237154,18.455534,356.674032,12.653063,22.532806
std,8.596783,23.322453,6.860353,0.253994,0.115878,0.702617,28.148861,2.105710,8.707259,168.537116,2.164946,91.294864,7.141062,9.197104
min,0.006320,0.000000,0.460000,0.000000,0.385000,3.561000,2.900000,1.129600,1.000000,187.000000,12.600000,0.320000,1.730000,5.000000
25%,0.082045,0.000000,5.190000,0.000000,0.449000,5.885500,45.025000,2.100175,4.000000,279.000000,17.400000,375.377500,6.950000,17.025000
50%,0.256510,0.000000,9.690000,0.000000,0.538000,6.208500,77.500000,3.207450,5.000000,330.000000,19.050000,391.440000,11.360000,21.200000
75%,3.647423,12.500000,18.100000,0.000000,0.624000,6.623500,94.075000,5.188425,24.000000,666.000000,20.200000,396.225000,16.955000,25.000000
max,88.976200,100.000000,27.740000,1.000000,0.871000,8.780000,100.000000,12.126500,24.000000,711.000000,22.000000,396.900000,37.970000,50.000000

In [81]:
housing_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 506 entries, 0 to 505
Data columns (total 14 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   CRIM     506 non-null    float64
 1   ZN       506 non-null    float64
 2   INDUS    506 non-null    float64
 3   CHAS     506 non-null    int64
 4   NOX      506 non-null    float64
 5   RM       506 non-null    float64
 6   AGE      506 non-null    float64
 7   DIS      506 non-null    float64
 8   RAD      506 non-null    int64
 9   TAX      506 non-null    int64
 10  PTRATIO  506 non-null    float64
 11  B        506 non-null    float64
 12  LSTAT    506 non-null    float64
 13  PRICE    506 non-null    float64
dtypes: float64(11), int64(3)
memory usage: 55.5 KB

In [82]:
housing_df.shape

(506, 14)

#####  <span style='color:Violet'>Excercise 7: </span> `Null Value Operations on the Dataset`

In [83]:
housing_df.isnull().any()

CRIM       False
ZN         False
INDUS      False
CHAS       False
NOX        False
RM         False
AGE        False
DIS        False
RAD        False
TAX        False
PTRATIO    False
B          False
LSTAT      False
PRICE      False
dtype: bool

In [84]:
housing_df.loc[:5, housing_df.isnull().any()]

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5]

In [85]:
housing_df.loc[:, housing_df.isnull().any()].describe()

ValueError: Cannot describe a DataFrame without columns

The `.csv` file was already cleaned and preprocessed as there was no null value.

In [86]:
housing_df['AGE'] = housing_df['AGE'].fillna(housing_df.mean())
housing_df['CHAS'] = housing_df['CHAS'].fillna(0)
housing_df = housing_df.fillna(housing_df.median())
housing_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 506 entries, 0 to 505
Data columns (total 14 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   CRIM     506 non-null    float64
 1   ZN       506 non-null    float64
 2   INDUS    506 non-null    float64
 3   CHAS     506 non-null    int64
 4   NOX      506 non-null    float64
 5   RM       506 non-null    float64
 6   AGE      506 non-null    float64
 7   DIS      506 non-null    float64
 8   RAD      506 non-null    int64
 9   TAX      506 non-null    int64
 10  PTRATIO  506 non-null    float64
 11  B        506 non-null    float64
 12  LSTAT    506 non-null    float64
 13  PRICE    506 non-null    float64
dtypes: float64(11), int64(3)
memory usage: 55.5 KB